<details ><summary>plan for infra_live_cluster_talos_image 2025-12-07 02:25:28 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # data.talos_image_factory_urls.this will be read during apply
  # (config refers to values not yet known)
 <= data "talos_image_factory_urls" "this" {
      + architecture  = "amd64"
      + id            = (known after apply)
      + platform      = "metal"
      + schematic_id  = (known after apply)
      + talos_version = "1.11.5"
      + urls          = (known after apply)
    }

  # talos_image_factory_schematic.this will be updated in-place
  ~ resource "talos_image_factory_schematic" "this" {
      ~ id        = "ea3a70ae3fe2b97a09e7cc5c2af208aa526ff882f3e02ad1917c16e8b4a9fe11" -> (known after apply)
      ~ schematic = <<-EOT
            "customization":
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/intel-ucode"
                - "siderolabs/qemu-guest-agent"
                - "siderolabs/util-linux-tools"
          -     - "siderolabs/zfs"
        EOT
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ initramfs           = "https://factory.talos.dev/image/ea3a70ae3fe2b97a09e7cc5c2af208aa526ff882f3e02ad1917c16e8b4a9fe11/v1.11.5/initramfs-amd64.xz" -> (known after apply)
  ~ installer           = "factory.talos.dev/metal-installer/ea3a70ae3fe2b97a09e7cc5c2af208aa526ff882f3e02ad1917c16e8b4a9fe11:v1.11.5" -> (known after apply)
  ~ kernel              = "https://factory.talos.dev/image/ea3a70ae3fe2b97a09e7cc5c2af208aa526ff882f3e02ad1917c16e8b4a9fe11/v1.11.5/kernel-amd64" -> (known after apply)
  ~ kernel_command_line = "https://factory.talos.dev/image/ea3a70ae3fe2b97a09e7cc5c2af208aa526ff882f3e02ad1917c16e8b4a9fe11/v1.11.5/cmdline-metal-amd64" -> (known after apply)
  ~ schematic_id        = "ea3a70ae3fe2b97a09e7cc5c2af208aa526ff882f3e02ad1917c16e8b4a9fe11" -> (known after apply)

```
</details>

<details ><summary>Terraform plan validation check (infra_live_cluster_talos_image)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |               RESOURCE               |
|--------|--------------------------------------|
| update | `talos_image_factory_schematic.this` |

| CHANGE |        OUTPUT         |
|--------|-----------------------|
| update | `initramfs`           |
|        | `installer`           |
|        | `kernel`              |
|        | `kernel_command_line` |
|        | `schematic_id`        |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p infra_live_cluster_talos_image
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>